src/cfe/МенеджерСинхронизаций/Catalogs/МС_НастройкиПодключений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>МС_НастройкиПодключений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПодключения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МС_ВидыПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьSSL</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПрокси</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиСервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиПорт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиПользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПассивныйРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньЗащищенногоСоединенияFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойКаталогFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заголовки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяЗаголовка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/Catalogs/МС_НастройкиПодключений/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		УстановитьПривилегированныйРежим(Истина);
		Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Строка(Объект.Ссылка.УникальныйИдентификатор()), "Пароль");
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Элементы.ГруппаВидыПодключений.ТекущаяСтраница = Элементы[ИмяСтраницыВидаПодключения(Объект.ВидПодключения)];

	// Значения - имена значений системного перечисления УровеньИспользованияЗащищенногоСоединенияFTP,
	// см. МС_НастройкиПодключений.УровеньЗащищенногоСоединенияFTP
	СписокУровней = Элементы.УровеньЗащищенногоСоединенияFTP.СписокВыбора;
	СписокУровней.Добавить("ТребоватьДляУправления", НСтр("ru = 'Требовать для управления (по умолчанию)'"));
	СписокУровней.Добавить("Требовать", НСтр("ru = 'Требовать'"));
	СписокУровней.Добавить("ИспользоватьЕслиВозможно", НСтр("ru = 'Использовать, если возможно'"));
	СписокУровней.Добавить("Авто", НСтр("ru = 'Авто'"));
	СписокУровней.Добавить("НеИспользовать", НСтр("ru = 'Не использовать'"));
	Элементы.УровеньЗащищенногоСоединенияFTP.РежимВыбораИзСписка = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРеквизитВСтрокуПодключения(ИмяРеквизита)

	НачалоСтроки = 0;
	НачалоКолонки = 0;
	КонецСтроки = 0;
	КонецКолонки = 0;
	
	Элементы.СтрокаПодключения.ПолучитьГраницыВыделения(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки);
	
	Объект.СтрокаПодключения = Лев(Объект.СтрокаПодключения, НачалоКолонки - 1) + ИмяРеквизита + Прав(Объект.СтрокаПодключения, СтрДлина(Объект.СтрокаПодключения) - НачалоКолонки + 1);

КонецПроцедуры

&НаКлиенте
Процедура ПользовательДобавитьВСтроку(Команда)
	
	ИмяРеквизита = """ + НастройкаПодключения.Пользователь + """;
	
	ДобавитьРеквизитВСтрокуПодключения(ИмяРеквизита);
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольДобавитьВСтроку(Команда)
	
	ИмяРеквизита = """ + НастройкаПодключения.Пароль + """;
	
	ДобавитьРеквизитВСтрокуПодключения(ИмяРеквизита);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПодключенияДобавитьВСтроку(Команда)
	
	ИмяРеквизита = "СтрокаПодключения";
	
	НачалоСтроки = 0;
	НачалоКолонки = 0;
	КонецСтроки = 0;
	КонецКолонки = 0;
	
	Элементы.КодПодключения.ПолучитьГраницыВыделения(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки);
	
	ИзменяемаяСтрока = СтрПолучитьСтроку(Объект.КодПодключения, НачалоСтроки);
	
	ИзменяемаяСтрока = Лев(ИзменяемаяСтрока, НачалоКолонки - 1) + ИмяРеквизита + Прав(ИзменяемаяСтрока, СтрДлина(ИзменяемаяСтрока) - НачалоКолонки + 1);
	
	НоваяСтрока = "";
	Для Счетчик = 1 По СтрЧислоСтрок(Объект.КодПодключения) Цикл
		
		НоваяСтрока = НоваяСтрока + ?(ЗначениеЗаполнено(НоваяСтрока), Символы.ПС, "");
		
		Если Счетчик = НачалоСтроки Тогда
			НоваяСтрока = НоваяСтрока + ИзменяемаяСтрока;
		Иначе
			НоваяСтрока = НоваяСтрока + СтрПолучитьСтроку(Объект.КодПодключения, Счетчик);
		КонецЕсли; 
		
	КонецЦикла; 
	
	Объект.КодПодключения = НоваяСтрока;
	
КонецПроцедуры
 
&НаСервереБезКонтекста
Процедура СохранитьПароль(Владелец, НовыйПароль)

	УстановитьПривилегированныйРежим(Истина);
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Строка(Владелец.УникальныйИдентификатор()), НовыйПароль, "Пароль");
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	
	// Проверка читает настройку и пароль из базы, поэтому несохраненные изменения в ней не участвуют.
	Если Объект.Ссылка.Пустая() Или Модифицированность Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед проверкой соединения необходимо записать настройку");
		Возврат;
	КонецЕсли;

	РезультатПроверки = ПроверитьСоединениеНаСервере(Объект.Ссылка);

	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатПроверки.Текст);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьСоединениеНаСервере(Знач ОбъектСсылка)

	Возврат Справочники.МС_НастройкиПодключений.ПроверитьСоединение(ОбъектСсылка);

КонецФункции

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Сохраненный пароль в форму не читается, поле пустое при открытии.
	// Пустое значение не записываем, иначе любая запись настройки затирает пароль.
	Если ЗначениеЗаполнено(Пароль) Тогда
		СохранитьПароль(ТекущийОбъект.Ссылка, Пароль);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталога_Завершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Сообщить("Каталог не выбран");
		Возврат;
	Иначе
		Для каждого РезультатВыбора Из Результат Цикл
			Объект[Параметры] = РезультатВыбора;
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ВидПодключенияПриИзменении(Элемент)
	
	Элементы.ГруппаВидыПодключений.ТекущаяСтраница = Элементы[ИмяСтраницыВидаПодключения(Объект.ВидПодключения)];
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяСтраницыВидаПодключения(Знач ВидПодключения)
	
	// Страница по-умолчанию
	Если ВидПодключения = "" Тогда
		ВидПодключения = "Произвольное";
	КонецЕсли; 
	
	Возврат "Группа" + ВидПодключения;
	
КонецФункции
